In [1]:
import pandas as pd

In [2]:
# reading from the csv file
df_exams = pd.read_csv('StudentsPerformance.csv')
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

# 1. Selecting two or more columns

In [16]:
# Select two columns using the [[]]
df_exams[['gender','math score']]

     gender  math score
0    female          72
1    female          69
2    female          90
3      male          47
4      male          76
..      ...         ...
995  female          88
996    male          62
997  female          59
998  female          68
999  female          77

[1000 rows x 2 columns]

In [17]:
# checkout the data type of the selected columns
type(df_exams[['gender', 'math score']])

pandas.core.frame.DataFrame

In [19]:
# Selecting 2 or more columns
df_exams[['gender', 'writing score', 'reading score', 'math score']]

     gender  writing score  reading score  math score
0    female             74             72          72
1    female             88             90          69
2    female             93             95          90
3      male             44             57          47
4      male             75             78          76
..      ...            ...            ...         ...
995  female             95             99          88
996    male             55             55          62
997  female             65             71          59
998  female             77             78          68
999  female             86             86          77

[1000 rows x 4 columns]

In [ ]:
# We cant select 2 or more columns with the '.'
# df_exams.'gender','math score'